# -*- mode: org; fill-column: 80; mode: auto-fill; -*-

#+TITLE:     FreedomBox Weekly Image Report
#+AUTHOR:    Nick Daly
#+EMAIL:     nick.m.daly@gmail.com
#+DATE:      2013-03-18 Mon
#+LANGUAGE:  en
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

Hi folks, welcome to the Nth weekly FreedomBox test image and progress report.
These images are a way to test the current (incomplete) FreedomBox build.

* Verification

  You can validate that the files have been downloaded correctly and haven't
  changed since I've published them by checking the files' signatures.

  First, download my key:

      : $ gpg --keyserver hkp://keys.gnupg.net --recv-key D95C32042EE54FFDB25EC3489F2733F40928D23A

  Then, verify each file's signature:

#+source: verify-files
#+headers: :results output
#+begin_src sh :exports none
ls -1 *bz2
#+end_src
#+name: gpg-verify
#+begin_src python :results output :var files=verify-files :exports none
  for afile in files.splitlines():
      print ("$ gpg --verify {0}.sig {0}".format(afile))
#+end_src
#+results: gpg-verify
: $ gpg --verify freedombox-unstable_2012.0915_dreamplug-armel-card.img.tar.bz2.sig.sig freedombox-unstable_2012.0915_dreamplug-armel-card.img.tar.bz2.sig
: $ gpg --verify freedombox-unstable_2012.0915_virtualbox-i386-hdd.vdi.tar.bz2.sig.sig freedombox-unstable_2012.0915_virtualbox-i386-hdd.vdi.tar.bz2.sig

  The checksums for each file, useful for additional verification, also follow.
#+name: checksums
#+source: checksums
#+begin_src python :var files=verify-files :exports none
  import subprocess

  def get_sums(afile):
      data = list()

      for executable in ("md5sum", "sha512sum"):
          x = subprocess.Popen([executable, afile], stdout=subprocess.PIPE)
          x.wait()
          data.append(x.communicate()[0].split()[0])

      return data

  all_data = list()

  for file in files.splitlines():
      file = file.strip()
      if not file: continue
      all_data.append([file] + get_sums(file))

  return all_data
#+end_src

